chain-service-frontend/src/test/resources/aaa.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Body>
		<ns2:submit2 xmlns:ns2="http://api.account.wexmarket.com/">
			<accountingRequest2>
				<entries>
					<accountCode>10005-USER-AVAILABLE</accountCode>
					<amount>100</amount>
					<direction>CR</direction>
					<unit>CNY</unit>
					<visible>true</visible>
				</entries>
				<entries>
					<accountCode>FUND_POOL_5_RECEIVEABLE</accountCode>
					<amount>100</amount>
					<delay>true</delay>
					<direction>DR</direction>
					<unit>CNY</unit>
					<visible>true</visible>
				</entries>
				<permenantFailure>false</permenantFailure>
				<productCode>WEXMARKET-CLAERING</productCode>
				<requestIdentity>
					<requestNo>20170713000016015</requestNo>
					<sourceCode>WEXMARKET-CLAERING</sourceCode>
				</requestIdentity>
			</accountingRequest2>
		</ns2:submit2>
	</soap:Body>
</soap:Envelope>